src/cf/InformationRegisters/ГрифыДоступаДля1СШтамп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрифыДоступаДля1СШтамп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ВидыДокументовДля1СШтамп.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВидыДокументовДля1СШтамп</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/CommonModules/ВизуализацияПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает константу Использовать1СШтамп
//
// Возвращаемое значение:
//   Булево
//
Функция Использовать1СШтамп() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.Использовать1СШтамп.Получить();
	
КонецФункции	

// Возвращает массив грифов доступа для 1С Штамп. Если пусто , то любые допустимы.
//
// Возвращаемое значение:
//   Массив из СправочникССылка.ГрифыДоступа
//
Функция ГрифыДоступаДля1СШтамп() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МассивГрифов = Новый Массив;
	Выборка = РегистрыСведений.ГрифыДоступаДля1СШтамп.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивГрифов.Добавить(Выборка.ГрифДоступа);
	КонецЦикла;	
	
	Возврат МассивГрифов;
	
КонецФункции	

// Возвращает массив видов документов для 1С Штамп. Если пусто , то любые допустимы.
//
// Возвращаемое значение:
//   Массив из СправочникССылка.ВидыДокументов
//
Функция ВидыДокументовДля1СШтамп() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	МассивВидов = Новый Массив;
	Выборка = РегистрыСведений.ВидыДокументовДля1СШтамп.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивВидов.Добавить(Выборка.ВидДокумента);
	КонецЦикла;	
	
	Возврат МассивВидов;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
